{
  "backend/main.mo": "Empty Motoko actor placeholder.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles defining light/dark theme variables and global styling rules.",
  "frontend/index.html": "Base HTML page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root component that renders CameraReaderScreen.",
  "frontend/src/components/AudioStateCue.tsx": "Emits audio cue messages for processing states but renders no UI.",
  "frontend/src/components/CameraPreview.tsx": "Camera view component with startup retries, preflight checks, user‑friendly errors, fallback UI, and photo capture handling.",
  "frontend/src/components/CameraStartupFallback.tsx": "Full‑screen prompt with CTA button to manually start the camera when automatic startup fails.",
  "frontend/src/components/LiveAnnouncer.tsx": "Screen‑reader live region component for announcing status messages.",
  "frontend/src/components/OrientationPrompt.tsx": "Full‑screen orientation warning prompting users to rotate to portrait with an assertive announcement.",
  "frontend/src/components/PlaybackControls.tsx": "Accessible playback control buttons for pausing, repeating, and adjusting TTS speed.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using authentication state with automatic cache invalidation.",
  "frontend/src/hooks/useCaptureHaptics.ts": "Provides a vibration helper for capture haptic feedback with safe fallback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login, identity persistence, and status flags using Dfinity AuthClient.",
  "frontend/src/hooks/useOnDeviceOcr.ts": "Implements an OCR hook that loads Tesseract.js from a CDN and recognizes text from image files with processing state and error handling.",
  "frontend/src/hooks/useOrientation.ts": "Returns whether the device is in portrait mode by listening to resize and orientation events.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing, indicating no backend queries are used.",
  "frontend/src/hooks/useTextToSpeech.ts": "Wraps the Web Speech API to provide speech playback with controls for rate, pause, resume, cancel, and error tracking.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for accessible color themes, focus indicators, and touch target sizing.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/screens/CameraReaderScreen.tsx": "Camera-based screen that captures images, performs OCR, speaks results, and manages announcements, orientation, and playback controls.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, radii, animations, plugins, and dark mode support.",
  "project_state.json": "Defines overall project state for an Android accessibility-focused OCR-to-speech app, including architecture notes, existing features, and known camera preview issues."
}