{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "Feature evidence report linking camera-related feature requirements to impacted frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining color variables, dark-mode themes, and base element styles.",
  "frontend/index.html": "Base HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders the main CameraReaderScreen component.",
  "frontend/src/components/AudioStateCue.tsx": "Maps processing states to predefined messages for parent-driven audio announcements.",
  "frontend/src/components/CameraPreview.tsx": "Full camera preview component handling permission checks, startup fallback logic, blank-preview detection, error mapping, capture, and retry flows.",
  "frontend/src/components/CameraStartupFallback.tsx": "UI overlay prompting the user to manually start the camera when automatic startup fails.",
  "frontend/src/components/LiveAnnouncer.tsx": "Screen-reader live region component announcing status messages when they change.",
  "frontend/src/components/OrientationPrompt.tsx": "Full-screen prompt instructing users to rotate their device to portrait orientation with associated screen-reader announcement.",
  "frontend/src/components/PlaybackControls.tsx": "Accessible playback control buttons for pause/resume, repeat, and speech-rate adjustments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCameraPermission.ts": "Provides a hook to check and track camera permission state using the Permissions API with fallbacks.",
  "frontend/src/hooks/useCaptureHaptics.ts": "Adds a simple vibration helper for capture feedback using the browser's vibrate API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, exposing identity, login, and logout state.",
  "frontend/src/hooks/useOnDeviceOcr.ts": "Loads Tesseract.js on demand and provides a hook to run on-device OCR on images with processing and error states.",
  "frontend/src/hooks/useOrientation.ts": "Detects portrait vs landscape orientation by monitoring window size changes.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder since no backend queries are used.",
  "frontend/src/hooks/useTextToSpeech.ts": "Wraps the Web Speech API to provide speech playback control, rate adjustment, and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and high-contrast accessible theme variables with utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/CameraReaderScreen.tsx": "Main screen that captures images, runs OCR, announces states, and manages text-to-speech playback with accessibility features.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, container settings, extended color system using CSS variables, custom animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "JSON describing project metadata for an Android OCR-to-speech app, including architecture notes, known camera issues, and a list of existing accessibility-focused features."
}