{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Metadata file listing camera‑related feature reports, associated components, files, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of major frontend components, hooks, and styles.",
  "frontend/index.css": "Tailwind base and theme variables defining color tokens and global styling for light and dark modes.",
  "frontend/index.html": "Basic HTML shell loading the React app entry point.",
  "frontend/src/App.tsx": "Renders the CameraReaderScreen as the sole application view.",
  "frontend/src/components/AudioStateCue.tsx": "Maps processing states to predefined messages and triggers announcements via parent LiveAnnouncer.",
  "frontend/src/components/CameraPreview.tsx": "Camera preview component handling startup flow, preflight checks, fallback UI, error mapping, and capture operations.",
  "frontend/src/components/CameraStartupFallback.tsx": "Accessible full‑screen fallback prompting the user to manually start the camera.",
  "frontend/src/components/LiveAnnouncer.tsx": "ARIA live region component for emitting screen‑reader announcements when messages change.",
  "frontend/src/components/OrientationPrompt.tsx": "Full‑screen prompt instructing users to rotate to portrait orientation with an assertive screen‑reader announcement.",
  "frontend/src/components/PlaybackControls.tsx": "Set of accessible playback control buttons for pause/resume, repeat, and speech‑rate adjustment.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useCaptureHaptics.ts": "Provides a simple vibration trigger for capture confirmation with fallback handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state using Dfinity AuthClient, exposing identity, login, logout, and status flags.",
  "frontend/src/hooks/useOnDeviceOcr.ts": "Implements on-device OCR using Tesseract.js loaded from CDN, managing a shared worker and exposing text recognition with loading and error states.",
  "frontend/src/hooks/useOrientation.ts": "Tracks screen orientation by comparing window dimensions and exposes portrait/landscape state.",
  "frontend/src/hooks/useQueries.ts": "Stub file indicating no backend queries are used.",
  "frontend/src/hooks/useTextToSpeech.ts": "Wraps the Web Speech API to provide speaking, pausing, resuming, rate control, and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for accessible color themes, focus states, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/screens/CameraReaderScreen.tsx": "Screen component handling camera capture, OCR processing, text-to-speech playback, and accessibility announcements.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing an Android accessibility-focused OCR-to-speech app, its architecture, features, and known camera-start issue. It includes requirement-linked features, notes on privacy and UX, and flags the file as a fix request."
}