{
  "backend/main.mo": "Empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature-to-file mapping JSON listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for all frontend source files.",
  "frontend/index.css": "Tailwind base/theme definitions and global styles with custom color variables for light and dark modes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Renders the CameraReaderScreen as the sole app view.",
  "frontend/src/components/AudioStateCue.tsx": "Maps processing states to spoken messages and triggers announcements via parent LiveAnnouncer.",
  "frontend/src/components/CameraPreview.tsx": "Full‑screen camera preview handling tap‑to‑capture, keyboard activation, and camera lifecycle management.",
  "frontend/src/components/LiveAnnouncer.tsx": "Screen‑reader live region component announcing changing status messages.",
  "frontend/src/components/OrientationPrompt.tsx": "Full‑screen portrait‑orientation prompt with an assertive ARIA announcement.",
  "frontend/src/components/PlaybackControls.tsx": "Large accessible buttons for pause/resume, repeat, and speech‑rate adjustments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors using React Query.",
  "frontend/src/hooks/useCaptureHaptics.ts": "Provides a vibration helper for capture confirmation with graceful fallback.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing identity load, login, and state tracking.",
  "frontend/src/hooks/useOnDeviceOcr.ts": "Loads Tesseract.js from a CDN, initializes a worker once, and exposes a hook to run on-device OCR on image files.",
  "frontend/src/hooks/useOrientation.ts": "Provides a hook that tracks whether the device is in portrait or landscape orientation via resize and orientation events.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because the app does not use backend queries.",
  "frontend/src/hooks/useTextToSpeech.ts": "Implements a text-to-speech hook using the Web Speech API with controls for speaking, pausing, resuming, canceling, and adjusting rate.",
  "frontend/src/index.css": "Tailwind base styles plus custom high-contrast theme variables and accessibility-focused utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/screens/CameraReaderScreen.tsx": "Main screen that captures camera images, runs on-device OCR, announces states, and uses TTS with accessible playback controls.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, radii, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing the accessibility-first OCR-to-speech app, its architecture, and implemented feature requirements."
}