{
  "kind": "build_request",
  "title": "Fix camera preview not starting reliably on first load",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Improve camera startup reliability so the live camera preview starts consistently on initial app load and after returning to the tab/app.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera isn't starting yp"
        ]
      },
      "acceptanceCriteria": [
        "On supported devices/browsers with camera permission granted, the preview shows within 2 seconds in at least 10 consecutive reloads.",
        "If the app is backgrounded and then resumed, the preview either remains active or restarts automatically without requiring a full page refresh.",
        "If the video element fails to reach a playable state after an initial start attempt, the app performs at least one automatic retry and then transitions to a user-action fallback (see REQ-10) rather than staying indefinitely on a loading screen."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add an accessible user-gesture fallback to start the camera when autoplay/permission policies prevent starting getUserMedia on mount (e.g., show a full-screen 'Tap to start camera' action when camera startup does not complete promptly).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera isn't starting yp"
        ]
      },
      "acceptanceCriteria": [
        "If the camera is not active after a short timeout (e.g., ~2–3 seconds) and no explicit error is available, a full-screen, high-contrast CTA appears allowing the user to start the camera with a tap.",
        "The fallback CTA is keyboard operable (Enter/Space) and screen-reader discoverable with a clear English label (e.g., 'Tap to start camera').",
        "Tapping the fallback CTA triggers the same camera start flow and, on success, the preview replaces the CTA automatically."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Improve camera error handling and user guidance to reduce \"camera isn't starting\" reports by providing actionable, English error states for common failures (permission denied, insecure context/HTTP, no camera device, camera already in use).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera isn't starting yp"
        ]
      },
      "acceptanceCriteria": [
        "When camera access is denied, the UI clearly instructs the user to allow camera permission in the browser settings and offers a Retry action.",
        "When running in an insecure context (non-HTTPS) or when camera APIs are unavailable, the UI clearly indicates the requirement (e.g., 'Camera requires HTTPS') and does not loop endlessly on 'Starting Camera...'.",
        "When the camera is already in use or cannot be started, the UI provides a Retry action and announces the error message through accessible live-region semantics.",
        "No error state blocks the user from attempting to retry camera access without reloading the page."
      ]
    }
  ],
  "constraints": [
    "Frontend files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and frontend/src/components/ui must not be edited; compose them instead.",
    "Do not send camera images or recognized text to the backend; all OCR remains on-device."
  ],
  "nonGoals": [
    "Adding backend persistence, history storage, or cloud upload.",
    "Adding third-party authentication beyond Internet Identity.",
    "Introducing real-time communication features (e.g., WebSockets)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}