{
  "kind": "build_request",
  "title": "Fix camera preview not starting and ensure reliable fallback + guidance",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-12",
      "text": "Fix the camera startup flow so the live camera preview reliably starts on initial load (on supported devices/browsers) instead of staying stuck on the loading screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera doesn't even start"
        ]
      },
      "acceptanceCriteria": [
        "On a device/browser that supports getUserMedia in a secure context (HTTPS), the camera preview transitions from \"Starting Camera...\" to a live video feed without requiring a manual reload.",
        "If automatic startup fails, the app must not remain indefinitely in a loading state; it must transition to either a clear error screen or the manual-start fallback.",
        "Re-entering the tab/app after backgrounding (visibilitychange to visible) triggers a camera resume attempt, and the preview starts if permissions/devices are available."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Ensure the manual user-gesture fallback to start the camera is triggered consistently when automatic startup does not complete promptly, and that the fallback action successfully starts the camera when tapped.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera doesn't even start"
        ]
      },
      "acceptanceCriteria": [
        "If the camera has not become active shortly after startup attempt, a full-screen fallback UI is shown with a single large \"Start Camera\" action (as implemented by CameraStartupFallback).",
        "Tapping the fallback \"Start Camera\" button performs a user-gesture camera start attempt and, on success, shows the live camera preview.",
        "Fallback and retry flows do not create an infinite loop of retries; after configured retries, the user always has an actionable next step (Start Camera, Retry Camera Access, or a specific error message)."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Improve camera error detection and user guidance so that when camera startup fails, the UI surfaces a specific, English, actionable message (e.g., HTTPS required, permission denied, no camera found, camera in use) rather than only showing a generic loading state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "The camera doesn't even start"
        ]
      },
      "acceptanceCriteria": [
        "If window.isSecureContext is false, show the existing HTTPS-required message and do not keep retrying indefinitely.",
        "If permission is denied, show an explicit permission-denied message and present a working \"Retry Camera Access\" button.",
        "If the camera is in use (NotReadableError/in-use), show the existing in-use guidance and present a working \"Retry Camera Access\" button.",
        "All user-facing error and status text remains in English."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Backend remains single-actor; do not introduce additional backend services or external databases.",
    "Do not send captured images or recognized text to the backend (on-device only)."
  ],
  "nonGoals": [
    "Adding new authentication methods beyond Internet Identity.",
    "Implementing real-time communication (WebSockets) or push notifications.",
    "Changing the core OCR-to-speech flow beyond what is necessary to fix camera startup reliability."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}