{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable camera startup with deterministic fallback and actionable error guidance",
  "requirements": [
    {
      "id": "REQ-12",
      "summary": "Make initial camera startup reliably transition from loading to live preview, including resume attempts on tab re-entry.",
      "acceptanceCriteria": [
        "On a device/browser that supports getUserMedia in a secure context (HTTPS), the camera preview transitions from \"Starting Camera...\" to a live video feed without requiring a manual reload.",
        "If automatic startup fails, the app must not remain indefinitely in a loading state; it must transition to either a clear error screen or the manual-start fallback.",
        "Re-entering the tab/app after backgrounding (visibilitychange to visible) triggers a camera resume attempt, and the preview starts if permissions/devices are available."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Refactor the startup flow into a small, explicit state machine (e.g., starting/loading vs delayed vs active) so the UI never renders an indefinite \"Starting Camera...\" screen when isLoading becomes false but the camera is still inactive. Ensure the startup watchdog is armed whenever a start is attempted (not only when isLoading is true), and that exceeding the watchdog transitions to fallback or an error state. Keep the existing visibilitychange resume attempt, but gate it to avoid overlapping/stacked start attempts. Use the selected \"camera\" component hook (useCamera) as the single integration point for starting/retrying the camera; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Ensure manual user-gesture fallback appears consistently when auto-start stalls and that tapping it reliably starts the camera without infinite retry loops.",
      "acceptanceCriteria": [
        "If the camera has not become active shortly after startup attempt, a full-screen fallback UI is shown with a single large \"Start Camera\" action (as implemented by CameraStartupFallback).",
        "Tapping the fallback \"Start Camera\" button performs a user-gesture camera start attempt and, on success, shows the live camera preview.",
        "Fallback and retry flows do not create an infinite loop of retries; after configured retries, the user always has an actionable next step (Start Camera, Retry Camera Access, or a specific error message)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Make fallback triggering deterministic: after a single auto-start attempt (and any bounded internal retries), if the camera is still not active within the configured timeout, transition to CameraStartupFallback. Ensure the fallback button triggers a gesture-based start attempt (calling the camera hook's start/retry capabilities) and on success clears fallback/error and shows the preview. Add guards to prevent recursive attemptStart loops and prevent multiple concurrent attempts (e.g., an in-flight flag). Use the selected \"camera\" component hook (useCamera) and the existing CameraStartupFallback component; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CameraStartupFallback.tsx",
          "operation": "modify",
          "description": "Align copy and accessibility to match the fallback intent (single prominent \"Start Camera\" action, clear instruction text), and ensure the CTA remains the only primary action in this view. Keep all user-facing text in English. Verify any related selected component usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Improve error detection and surface specific, actionable English guidance for common camera startup failures (HTTPS, permission denied, in-use).",
      "acceptanceCriteria": [
        "If window.isSecureContext is false, show the existing HTTPS-required message and do not keep retrying indefinitely.",
        "If permission is denied, show an explicit permission-denied message and present a working \"Retry Camera Access\" button.",
        "If the camera is in use (NotReadableError/in-use), show the existing in-use guidance and present a working \"Retry Camera Access\" button.",
        "All user-facing error and status text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Tighten preflight + error mapping so failures consistently render an actionable error screen instead of falling through to loading. Specifically: (1) treat non-secure context as a terminal state (no repeated auto-retries); (2) ensure permission-denied and in-use scenarios are detected reliably (via the hook error.type plus message heuristics) and always show the \"Retry Camera Access\" button wired to the hook retry() call; (3) ensure status/error strings announced via onStatusChange remain English and are not spammed by repeated retries. Use the selected \"camera\" component hook (useCamera) for error information and retry capability; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}