{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable camera preview startup with retry, resume handling, and accessible fallback",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Make camera preview start reliably on first load and resume automatically after tab/app returns, with bounded retries.",
      "acceptanceCriteria": [
        "On supported devices/browsers with camera permission granted, the preview shows within 2 seconds in at least 10 consecutive reloads.",
        "If the app is backgrounded and then resumed, the preview either remains active or restarts automatically without requiring a full page refresh.",
        "If the video element fails to reach a playable state after an initial start attempt, the app performs at least one automatic retry and then transitions to a user-action fallback (see REQ-10) rather than staying indefinitely on a loading screen."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Improve startup flow using the selected camera component’s `useCamera` hook (start + verify playable state + at least one automatic retry). Add document visibility/focus handling to re-attempt start (or resume playback) when returning to the tab/app, and ensure the UI does not remain indefinitely in a loading state. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/CameraReaderScreen.tsx",
          "operation": "modify",
          "description": "Wire camera lifecycle status events (e.g., resumed/retrying/ready) into existing screen-level announcements so users get feedback during automatic restart attempts after returning to the tab/app."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add an accessible full-screen user-gesture CTA fallback to start the camera when automatic startup does not complete promptly.",
      "acceptanceCriteria": [
        "If the camera is not active after a short timeout (e.g., ~2–3 seconds) and no explicit error is available, a full-screen, high-contrast CTA appears allowing the user to start the camera with a tap.",
        "The fallback CTA is keyboard operable (Enter/Space) and screen-reader discoverable with a clear English label (e.g., 'Tap to start camera').",
        "Tapping the fallback CTA triggers the same camera start flow and, on success, the preview replaces the CTA automatically."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraStartupFallback.tsx",
          "operation": "create",
          "description": "Create a full-screen, high-contrast, accessible fallback overlay with a single clear CTA ('Tap to start camera') that supports click and Enter/Space. This overlay will be used when camera startup is not confirmed within ~2–3 seconds. Use existing shadcn/ui `Button` for consistency; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Add a bounded startup watchdog (~2–3 seconds) that, when the camera isn’t confirmed playable and no explicit error is available, shows `CameraStartupFallback`. Wire the CTA to call the same start flow (`startCamera`/retry) from the selected camera component’s `useCamera` hook and hide the overlay automatically upon success. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Provide actionable, accessible English error states and retry guidance for common camera failures without requiring page reload.",
      "acceptanceCriteria": [
        "When camera access is denied, the UI clearly instructs the user to allow camera permission in the browser settings and offers a Retry action.",
        "When running in an insecure context (non-HTTPS) or when camera APIs are unavailable, the UI clearly indicates the requirement (e.g., 'Camera requires HTTPS') and does not loop endlessly on 'Starting Camera...'.",
        "When the camera is already in use or cannot be started, the UI provides a Retry action and announces the error message through accessible live-region semantics.",
        "No error state blocks the user from attempting to retry camera access without reloading the page."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CameraPreview.tsx",
          "operation": "modify",
          "description": "Add preflight checks (secure context / camera API availability) to present immediate actionable guidance (e.g., HTTPS required) instead of looping on loading. Map errors from the selected camera component’s `useCamera` hook (and common browser error phrases) into user-friendly English messages for: permission denied, not supported, no device found, camera in use/NotReadable, and generic failures. Provide a Retry action that calls `retry`/`startCamera` and include an aria-live (assertive) announcement region for errors and retry results. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/screens/CameraReaderScreen.tsx",
          "operation": "modify",
          "description": "Ensure camera error and guidance messages are also discoverable via the existing `LiveAnnouncer` mechanism (e.g., pass a callback/prop so camera errors trigger announcements) while keeping OCR fully on-device and not sending images/text to any backend."
        }
      ]
    }
  ]
}